wosayttn/M55M1BSP/Library/StdDriver/src/clk.c
  * |\ref UART5_MODULE   |\ref CLK_UARTSEL0_UART5SEL_HXT            |\ref CLK_UARTDIV0_UART5DIV(x)   |
  * |\ref UART5_MODULE   |\ref CLK_UARTSEL0_UART5SEL_HIRC           |\ref CLK_UARTDIV0_UART5DIV(x)   |
  * |\ref UART5_MODULE   |\ref CLK_UARTSEL0_UART5SEL_LXT            |\ref CLK_UARTDIV0_UART5DIV(x)   |
  * |\ref UART5_MODULE   |\ref CLK_UARTSEL0_UART5SEL_APLL0_DIV2     |\ref CLK_UARTDIV0_UART5DIV(x)   |
  * |\ref UART5_MODULE   |\ref CLK_UARTSEL0_UART5SEL_HIRC48M        |\ref CLK_UARTDIV0_UART5DIV(x)   |
  * |\ref UART6_MODULE   |\ref CLK_UARTSEL0_UART6SEL_HXT            |\ref CLK_UARTDIV0_UART6DIV(x)   |
  * |\ref UART6_MODULE   |\ref CLK_UARTSEL0_UART6SEL_HIRC           |\ref CLK_UARTDIV0_UART6DIV(x)   |
  * |\ref UART6_MODULE   |\ref CLK_UARTSEL0_UART6SEL_LXT            |\ref CLK_UARTDIV0_UART6DIV(x)   |
  * |\ref UART6_MODULE   |\ref CLK_UARTSEL0_UART6SEL_APLL0_DIV2     |\ref CLK_UARTDIV0_UART6DIV(x)   |
  * |\ref UART6_MODULE   |\ref CLK_UARTSEL0_UART6SEL_HIRC48M        |\ref CLK_UARTDIV0_UART6DIV(x)   |
  * |\ref UART7_MODULE   |\ref CLK_UARTSEL0_UART7SEL_HXT            |\ref CLK_UARTDIV0_UART7DIV(x)   |
  * |\ref UART7_MODULE   |\ref CLK_UARTSEL0_UART7SEL_HIRC           |\ref CLK_UARTDIV0_UART7DIV(x)   |
  * |\ref UART7_MODULE   |\ref CLK_UARTSEL0_UART7SEL_LXT            |\ref CLK_UARTDIV0_UART7DIV(x)   |
  * |\ref UART7_MODULE   |\ref CLK_UARTSEL0_UART7SEL_APLL0_DIV2     |\ref CLK_UARTDIV0_UART7DIV(x)   |
  * |\ref UART7_MODULE   |\ref CLK_UARTSEL0_UART7SEL_HIRC48M        |\ref CLK_UARTDIV0_UART7DIV(x)   |
  * |\ref UART8_MODULE   |\ref CLK_UARTSEL1_UART8SEL_HXT            |\ref CLK_UARTDIV1_UART8DIV(x)   |
  * |\ref UART8_MODULE   |\ref CLK_UARTSEL1_UART8SEL_HIRC           |\ref CLK_UARTDIV1_UART8DIV(x)   |
  * |\ref UART8_MODULE   |\ref CLK_UARTSEL1_UART8SEL_LXT            |\ref CLK_UARTDIV1_UART8DIV(x)   |
  * |\ref UART8_MODULE   |\ref CLK_UARTSEL1_UART8SEL_APLL0_DIV2     |\ref CLK_UARTDIV1_UART8DIV(x)   |
  * |\ref UART8_MODULE   |\ref CLK_UARTSEL1_UART8SEL_HIRC48M        |\ref CLK_UARTDIV1_UART8DIV(x)   |
  * |\ref UART9_MODULE   |\ref CLK_UARTSEL1_UART9SEL_HXT            |\ref CLK_UARTDIV1_UART9DIV(x)   |
  * |\ref UART9_MODULE   |\ref CLK_UARTSEL1_UART9SEL_HIRC           |\ref CLK_UARTDIV1_UART9DIV(x)   |
  * |\ref UART9_MODULE   |\ref CLK_UARTSEL1_UART9SEL_LXT            |\ref CLK_UARTDIV1_UART9DIV(x)   |
  * |\ref UART9_MODULE   |\ref CLK_UARTSEL1_UART9SEL_APLL0_DIV2     |\ref CLK_UARTDIV1_UART9DIV(x)   |
  * |\ref UART9_MODULE   |\ref CLK_UARTSEL1_UART9SEL_HIRC48M        |\ref CLK_UARTDIV1_UART9DIV(x)   |
  * |\ref USBD0_MODULE   |\ref CLK_USBSEL_USBSEL_HIRC48M            |\ref CLK_USBDIV_USBDIV(x)       |
  * |\ref USBD0_MODULE   |\ref CLK_USBSEL_USBSEL_APLL1_DIV2         |\ref CLK_USBDIV_USBDIV(x)       |
  * |\ref USBH0_MODULE   |\ref CLK_USBSEL_USBSEL_HIRC48M            |\ref CLK_USBDIV_USBDIV(x)       |
  * |\ref USBH0_MODULE   |\ref CLK_USBSEL_USBSEL_APLL1_DIV2         |\ref CLK_USBDIV_USBDIV(x)       |
  * |\ref WDT0_MODULE    |\ref CLK_WDTSEL_WDT0SEL_LXT               | x                              |
  * |\ref WDT0_MODULE    |\ref CLK_WDTSEL_WDT0SEL_HCLK2_DIV2048     | x                              |
  * |\ref WDT0_MODULE    |\ref CLK_WDTSEL_WDT0SEL_LIRC              | x                              |
  * |\ref WDT1_MODULE    |\ref CLK_WDTSEL_WDT1SEL_LXT               | x                              |
  * |\ref WDT1_MODULE    |\ref CLK_WDTSEL_WDT1SEL_HCLK2_DIV2048     | x                              |
  * |\ref WDT1_MODULE    |\ref CLK_WDTSEL_WDT1SEL_LIRC              | x                              |
  * |\ref WWDT0_MODULE   |\ref CLK_WWDTSEL_WWDT0SEL_HCLK0_DIV2048   | x                              |
  * |\ref WWDT0_MODULE   |\ref CLK_WWDTSEL_WWDT0SEL_LIRC            | x                              |
  * |\ref WWDT1_MODULE   |\ref CLK_WWDTSEL_WWDT1SEL_HCLK0_DIV2048   | x                              |
  * |\ref WWDT1_MODULE   |\ref CLK_WWDTSEL_WWDT1SEL_LIRC            | x                              |
  */
void CLK_SetModuleClock(uint64_t u64ModuleIdx, uint32_t u32ClkSrc, uint32_t u32ClkDiv)
{
    uint32_t u32Sel = 0UL, u32Div = 0UL;
    uint32_t u32RTCCKEN = CLK->RTCCTL & CLK_RTCCTL_RTC0CKEN_Msk;

    if(u64ModuleIdx == RTC0_MODULE)      /* RTC clock source configuration */
    {
        if(u32RTCCKEN == 0UL)
        {
            CLK->RTCCTL |= CLK_RTCCTL_RTC0CKEN_Msk; /* Enable RTC clock to get LXT clock source */
        }

        /* Select RTC clock source */
        RTC->LXTCTL = (RTC->LXTCTL & (~RTC_LXTCTL_RTCCKSEL_Msk)) | (u32ClkSrc);

        if(u32RTCCKEN == 0UL)
        {
            CLK->RTCCTL &= (~CLK_RTCCTL_RTC0CKEN_Msk); /* Disable RTC clock if it is disabled before */
        }
    }
    else /* Others clock source configuration */
    {
        /* Configure clock source divider */
        if(MODULE_CLKDIV_Msk(u64ModuleIdx) != MODULE_NoMsk)
        {
            /* Get clock divider control register address */
            u32Div = (uint32_t)MODULE_CLKDIV_BASE + ((uint32_t)MODULE_CLKDIV(u64ModuleIdx) << 2);
            /* Apply new divider */
            M32(u32Div) = (M32(u32Div) & (~((uint32_t)MODULE_CLKDIV_Msk(u64ModuleIdx) << (uint32_t)MODULE_CLKDIV_Pos(u64ModuleIdx)))) | u32ClkDiv;
        }

        /* Configure clock source */
        if(MODULE_CLKSEL_Msk(u64ModuleIdx) != MODULE_NoMsk)
        {
            /* Get clock select control register address */
            u32Sel = (uint32_t)MODULE_CLKSEL_BASE + ((uint32_t)MODULE_CLKSEL(u64ModuleIdx) << 2);
            /* Set new clock selection setting */
            M32(u32Sel) = (M32(u32Sel) & (~((uint32_t)MODULE_CLKSEL_Msk(u64ModuleIdx) << (uint32_t)MODULE_CLKSEL_Pos(u64ModuleIdx)))) | u32ClkSrc;
        }
    }
}

/**
  * @brief      Set SysTick clock source
  * @param[in]  u32ClkSrc is module clock source. Including:
  *             - \ref CLK_STSEL_ST0SEL_HXT
  *             - \ref CLK_STSEL_ST0SEL_LXT
  *             - \ref CLK_STSEL_ST0SEL_HXT_DIV2
  *             - \ref CLK_STSEL_ST0SEL_ACLK_DIV2
  *             - \ref CLK_STSEL_ST0SEL_HIRC_DIV2
  * @return     None
  * @details    This function set SysTick clock source. \n
  *             The register write-protection function should be disabled before using this function.
  */
void CLK_SetSysTickClockSrc(uint32_t u32ClkSrc)
{
    CLK->STSEL = (CLK->STSEL & ~CLK_STSEL_ST0SEL_Msk) | u32ClkSrc;
}

/**
  * @brief      Enable clock source
  * @param[in]  u32ClkMask is clock source mask. Including :
  *             - \ref CLK_SRCCTL_HXTEN_Msk
  *             - \ref CLK_SRCCTL_LXTEN_Msk
  *             - \ref CLK_SRCCTL_HIRCEN_Msk
  *             - \ref CLK_SRCCTL_LIRCEN_Msk
  *             - \ref CLK_SRCCTL_HIRC48MEN_Msk
  * @return     None
  * @details    This function enable clock source. \n
  *             The register write-protection function should be disabled before using this function.
  */
void CLK_EnableXtalRC(uint32_t u32ClkMask)
{
    CLK->SRCCTL |= u32ClkMask;
}

/**
  * @brief      Disable clock source
  * @param[in]  u32ClkMask is clock source mask. Including :
  *             - \ref CLK_SRCCTL_HXTEN_Msk
  *             - \ref CLK_SRCCTL_LXTEN_Msk
  *             - \ref CLK_SRCCTL_HIRCEN_Msk
  *             - \ref CLK_SRCCTL_LIRCEN_Msk
  *             - \ref CLK_SRCCTL_HIRC48MEN_Msk
  *             - \ref CLK_SRCCTL_APLL0EN_Msk
  *             - \ref CLK_SRCCTL_APLL1EN_Msk
  * @return     None
  * @details    This function disable clock source. \n
  *             The register write-protection function should be disabled before using this function.
  */
void CLK_DisableXtalRC(uint32_t u32ClkMask)
{
    CLK->SRCCTL &= ~u32ClkMask;
}

/**
  * @brief      Enable module clock
  * @param[in]  u64ModuleIdx is module index. Including :
  *             - \ref ACMP01_MODULE
  *             - \ref ACMP23_MODULE
  *             - \ref AWF0_MODULE
  *             - \ref BPWM0_MODULE
  *             - \ref BPWM1_MODULE
  *             - \ref CANFD0_MODULE
  *             - \ref CANFD1_MODULE
  *             - \ref CCAP0_MODULE
  *             - \ref CRC0_MODULE
  *             - \ref CRYPTO0_MODULE
  *             - \ref DAC01_MODULE
  *             - \ref DMIC0_MODULE
  *             - \ref EADC0_MODULE
  *             - \ref EADC1_MODULE
  *             - \ref EBI0_MODULE
  *             - \ref ECAP0_MODULE
  *             - \ref ECAP1_MODULE
  *             - \ref ECAP2_MODULE
  *             - \ref ECAP3_MODULE
  *             - \ref EMAC0_MODULE
  *             - \ref EPWM0_MODULE
  *             - \ref EPWM1_MODULE
  *             - \ref EQEI0_MODULE
  *             - \ref EQEI1_MODULE
  *             - \ref EQEI2_MODULE
  *             - \ref EQEI3_MODULE
  *             - \ref FMC0_MODULE
  *             - \ref ISP0_MODULE
  *             - \ref GDMA0_MODULE
  *             - \ref GPIOA_MODULE
  *             - \ref GPIOB_MODULE
  *             - \ref GPIOC_MODULE
  *             - \ref GPIOD_MODULE
  *             - \ref GPIOE_MODULE
  *             - \ref GPIOF_MODULE
  *             - \ref GPIOG_MODULE
  *             - \ref GPIOH_MODULE
  *             - \ref GPIOI_MODULE
  *             - \ref GPIOJ_MODULE
  *             - \ref HSOTG0_MODULE
  *             - \ref HSUSBD0_MODULE
  *             - \ref HSUSBH0_MODULE
  *             - \ref I2C0_MODULE
  *             - \ref I2C1_MODULE
  *             - \ref I2C2_MODULE
  *             - \ref I2C3_MODULE
  *             - \ref I2S0_MODULE
  *             - \ref I2S1_MODULE
  *             - \ref I3C0_MODULE
  *             - \ref KDF0_MODULE
  *             - \ref KPI0_MODULE
  *             - \ref KS0_MODULE
  *             - \ref LPADC0_MODULE
  *             - \ref LPPDMA0_MODULE
  *             - \ref LPGPIO0_MODULE
  *             - \ref LPI2C0_MODULE
  *             - \ref LPSPI0_MODULE
  *             - \ref LPSRAM0_MODULE
  *             - \ref LPTMR0_MODULE
  *             - \ref LPTMR1_MODULE
  *             - \ref LPUART0_MODULE
  *             - \ref NPU0_MODULE
  *             - \ref OTFC0_MODULE
  *             - \ref OTFC1_MODULE
  *             - \ref OTG0_MODULE
  *             - \ref PDMA0_MODULE
  *             - \ref PDMA1_MODULE
  *             - \ref PSIO0_MODULE
  *             - \ref QSPI0_MODULE
  *             - \ref QSPI1_MODULE
  *             - \ref RTC0_MODULE
  *             - \ref SC0_MODULE
  *             - \ref SC1_MODULE
  *             - \ref SC2_MODULE
  *             - \ref SCU0_MODULE
  *             - \ref SDH0_MODULE
  *             - \ref SDH1_MODULE
  *             - \ref SENTH0_MODULE
  *             - \ref SPI0_MODULE
  *             - \ref SPI1_MODULE
  *             - \ref SPI2_MODULE
  *             - \ref SPI3_MODULE
  *             - \ref SPIM0_MODULE
  *             - \ref SPIM1_MODULE
  *             - \ref SRAM0_MODULE
  *             - \ref SRAM1_MODULE
  *             - \ref SRAM2_MODULE
  *             - \ref SWDH0_MODULE
  *             - \ref SWODEC0_MODULE
  *             - \ref ST0_MODULE
  *             - \ref TAMPER0_MODULE
  *             - \ref TMR0_MODULE
  *             - \ref TMR1_MODULE
  *             - \ref TMR2_MODULE
  *             - \ref TMR3_MODULE
  *             - \ref TRNG0_MODULE
  *             - \ref TTMR0_MODULE
  *             - \ref TTMR1_MODULE
  *             - \ref UART0_MODULE
  *             - \ref UART1_MODULE  
  *             - \ref UART2_MODULE
  *             - \ref UART3_MODULE
  *             - \ref UART4_MODULE
  *             - \ref UART5_MODULE
  *             - \ref UART6_MODULE
  *             - \ref UART7_MODULE
  *             - \ref UART8_MODULE
  *             - \ref UART9_MODULE
  *             - \ref USBD0_MODULE
  *             - \ref USBH0_MODULE
  *             - \ref USCI0_MODULE
  *             - \ref UTCPD0_MODULE
  *             - \ref WDT0_MODULE
  *             - \ref WDT1_MODULE
  *             - \ref WWDT0_MODULE
  *             - \ref WWDT1_MODULE
  * @retval     0  clock is not stable
  * @retval     1  clock is stable
  * @details    This function is used to enable module clock.
  */
uint32_t CLK_EnableModuleClock(uint64_t u64ModuleIdx)
{
    uint32_t u32TmpVal = 0UL, u32TmpAddr = 0UL;
    uint32_t u32Ret = 1U;
    uint32_t u32TimeOutCnt = SystemCoreClock>>1; /* 500ms time-out */
    
