wosayttn/M55M1BSP/Library/StdDriver/src/clk.c
    /* Check clock stable */
    while((*(volatile uint32_t *)u32TmpAddr & BIT31) == 0UL)
    {
        if(--u32TimeOutCnt == 0)
        {
            u32Ret = 0U;
            break;
        }
    }

    return u32Ret;
}

/**
  * @brief      Set PLL frequency
  * @param[in]  u32PllClkSrc is PLL clock source. Including :
  *             - \ref CLK_APLLCTL_APLLSRC_HXT
  *             - \ref CLK_APLLCTL_APLLSRC_HIRC
  *             - \ref CLK_APLLCTL_APLLSRC_HIRC48_DIV4
  * @param[in]  u32PllFreq is PLL frequency. The range of u32PllFreq is 50 MHz ~ 500 MHz.
  * @param[in]  u32PllSelect is PLL selection. Including :
  *             - \ref CLK_APLL0_SELECT
  *             - \ref CLK_APLL1_SELECT
  * @return     PLL frequency
  * @details    This function is used to configure PLLCTL register to set specified PLL frequency. \n
  *             The register write-protection function should be disabled before using this function.
  */
uint32_t CLK_EnableAPLL(uint32_t u32PllClkSrc, uint32_t u32PllFreq, uint32_t u32PllSelect)
{
    uint32_t u32PllSrcClk, u32NR, u32NF, u32NO, u32PllClk, u32StableSel;
    uint32_t u32Tmp, u32Tmp2, u32Tmp3, u32Min, u32MinNF, u32MinNR;

    /* Disable PLL first to avoid unstable when setting PLL */
    if(u32PllSelect == CLK_APLL0_SELECT)
    {
        CLK_DisableAPLL(CLK_APLL0_SELECT);
    }
    else
    {
        CLK_DisableAPLL(CLK_APLL1_SELECT);
    }

    /* PLL source clock is from HXT */
    if(u32PllClkSrc == CLK_APLLCTL_APLLSRC_HXT)
    {
        /* Enable HXT clock */
        CLK->SRCCTL |= CLK_SRCCTL_HXTEN_Msk;

        /* Wait for HXT clock ready */
        CLK_WaitClockReady(CLK_STATUS_HXTSTB_Msk);

        /* Select PLL source clock from HXT */
        u32PllSrcClk = __HXT;
    }
    /* PLL source clock is from HIRC */
    else if(u32PllClkSrc == CLK_APLLCTL_APLLSRC_HIRC)
    {
        /* Enable HIRC clock */
        CLK->SRCCTL |= CLK_SRCCTL_HIRCEN_Msk;

        /* Wait for HIRC clock ready */
        CLK_WaitClockReady(CLK_STATUS_HIRCSTB_Msk);

        /* Select PLL source clock from HIRC */
        u32PllSrcClk = __HIRC;
    }
    else /* PLL source clock is from HIRC48M */
    {
        /* Enable HIRC48M clock */
        CLK->SRCCTL |= CLK_SRCCTL_HIRC48MEN_Msk;

        /* Wait for HIRC48M clock ready */
        CLK_WaitClockReady(CLK_STATUS_HIRC48MSTB_Msk);

        /* Select PLL source clock from HIRC48M/4 */
        u32PllSrcClk = __HIRC48M / 4;
    }

    /* Select APLL stable count */
    if(u32PllSrcClk <= FREQ_4MHZ)
    {
        u32StableSel = CLK_APLL0CTL_STBSEL_800;
    }
    else if((u32PllSrcClk > FREQ_4MHZ) && (u32PllSrcClk <= FREQ_12MHZ))
    {
        u32StableSel = CLK_APLL0CTL_STBSEL_2400;
    }
    else if((u32PllSrcClk > FREQ_12MHZ) && (u32PllSrcClk <= FREQ_24MHZ))
    {
        u32StableSel = CLK_APLL0CTL_STBSEL_4800;
    }
    else /* (u32PllSrcClk > FREQ_24MHZ) */
    {
        u32StableSel = CLK_APLL0CTL_STBSEL_6400;
    }

    /* Check PLL frequency range */
    /* Constraint 1: 50MHz < FOUT < 500MHz */
    if((u32PllFreq <= FREQ_500MHZ) && (u32PllFreq >= FREQ_50MHZ))
    {
        /* Select "NO" according to request frequency */
        if((u32PllFreq < FREQ_100MHZ) && (u32PllFreq >= FREQ_50MHZ))
        {
            u32NO = 3UL;
            u32PllFreq = u32PllFreq << 2;
        }
        else if((u32PllFreq < FREQ_200MHZ) && (u32PllFreq >= FREQ_100MHZ))
        {
            u32NO = 1UL;
            u32PllFreq = u32PllFreq << 1;
        }
        else
        {
            u32NO = 0UL;
        }

        /* u32NR start from 3 to avoid calculation overflow */
        u32NR = 3UL;

        /* Find best solution */
        u32Min = (uint32_t) - 1;    /* initial u32Min to max value of uint32_t (0xFFFFFFFF) */
        u32MinNR = 0UL;
        u32MinNF = 0UL;

        for(; u32NR <= 32UL; u32NR++)   /* max NR = 32 since NR = INDIV+1 and INDIV = 0~31 */
        {
            u32Tmp = u32PllSrcClk / u32NR;                      /* FREF = FIN/NR */
            if((u32Tmp >= FREQ_4MHZ) && (u32Tmp <= FREQ_8MHZ))  /* Constraint 2: 4MHz < FREF < 8MHz. */
            {
                for(u32NF = 2UL; u32NF <= 513UL; u32NF++)       /* NF = 2~513 since NF = FBDIV+2 and FBDIV = 0~511 */
                {
                    u32Tmp2 = (u32Tmp * u32NF) << 1;                            /* FVCO = FREF*2*NF */
                    if((u32Tmp2 >= FREQ_200MHZ) && (u32Tmp2 <= FREQ_500MHZ))    /* Constraint 3: 200MHz < FVCO < 500MHz */
                    {
                        u32Tmp3 = (u32Tmp2 > u32PllFreq) ? u32Tmp2 - u32PllFreq : u32PllFreq - u32Tmp2;
                        if(u32Tmp3 < u32Min)
                        {
                            u32Min = u32Tmp3;
                            u32MinNR = u32NR;
                            u32MinNF = u32NF;

                            /* Break when get good results */
                            if(u32Min == 0UL)
                            {
                                break;
                            }
                        }
                    }
                }
            }
        }
        if(u32PllSelect == CLK_APLL0_SELECT)
        {
            /* Apply new PLL0 setting. */
            CLK->APLL0CTL = (u32NO << CLK_APLL0CTL_OUTDIV_Pos) |
                            (u32StableSel) |
                            ((u32MinNR - 1UL) << CLK_APLL0CTL_INDIV_Pos) |
                            ((u32MinNF - 2UL) << CLK_APLL0CTL_FBDIV_Pos);
            
            /* Apply PLL0 Clock Source */
            CLK->APLL0SEL = (CLK->APLL0SEL & ~CLK_APLL0SEL_APLLSRC_Msk) | u32PllClkSrc << CLK_APLL0SEL_APLLSRC_Pos;
            
            /* Enable PLL0 */
            CLK->SRCCTL |= CLK_SRCCTL_APLL0EN_Msk;
        }
        else
        {
            /* Apply new PLL1 setting. */
            CLK->APLL1CTL = (u32NO << CLK_APLL1CTL_OUTDIV_Pos) |
                            (u32StableSel) |            
                            ((u32MinNR - 1UL) << CLK_APLL1CTL_INDIV_Pos) |
                            ((u32MinNF - 2UL) << CLK_APLL1CTL_FBDIV_Pos);
            
