wosayttn/M55M1BSP/Library/StdDriver/src/clk.c
            /* Apply PLL1 Clock Source */
            CLK->APLL1SEL = (CLK->APLL1SEL & ~CLK_APLL1SEL_APLLSRC_Msk) | u32PllClkSrc << CLK_APLL1SEL_APLLSRC_Pos;
            
            /* Enable PLL1 */
            CLK->SRCCTL |= CLK_SRCCTL_APLL1EN_Msk;
        }
        /* Actual PLL output clock frequency. FOUT = (FIN/NR)*2*NF*(1/NO) */
        u32PllClk = u32PllSrcClk / ((u32NO + 1UL) * u32MinNR) * (u32MinNF << 1);
    }
    else
    {
        /* Apply default PLL setting and return */
        if(u32PllSelect == CLK_APLL0_SELECT)
        {
            CLK->APLL0CTL = u32StableSel | CLK_APLLCTL_200MHz_HIRC;
            
            /* Apply PLL0 Clock Source */
            CLK->APLL0SEL = (CLK->APLL0SEL & ~CLK_APLL0SEL_APLLSRC_Msk) | u32PllClkSrc << CLK_APLL0SEL_APLLSRC_Pos;
            
            /* Enable PLL0 */
            CLK->SRCCTL |= CLK_SRCCTL_APLL0EN_Msk;
        }
        else
        {
            CLK->APLL1CTL = u32StableSel | CLK_APLLCTL_200MHz_HIRC;

            /* Apply PLL1 Clock Source */
            CLK->APLL1SEL = (CLK->APLL1SEL & ~CLK_APLL1SEL_APLLSRC_Msk) | u32PllClkSrc << CLK_APLL1SEL_APLLSRC_Pos;

            /* Enable PLL1 */
            CLK->SRCCTL |= CLK_SRCCTL_APLL1EN_Msk;
        }

        /* Actual PLL output clock frequency */
        u32PllClk = FREQ_200MHZ;
    }

    /* Wait for PLL clock stable */
    if(u32PllSelect == CLK_APLL0_SELECT)
    {    
        CLK_WaitClockReady(CLK_STATUS_APLL0STB_Msk);
    }
    else
    {
        CLK_WaitClockReady(CLK_STATUS_APLL1STB_Msk);
    }

    /* Return actual PLL output clock frequency */
    return u32PllClk;
}

/**
  * @brief      Disable PLL
  * @param[in]  u32PllSelect is PLL selection. Including :
  *             - \ref CLK_APLL0_SELECT
  *             - \ref CLK_APLL1_SELECT
  * @return     None
  * @details    Disable PLL. \n
  *             The register write-protection function should be disabled before using this function.
  */
void CLK_DisableAPLL(uint32_t u32PllSelect)
{
    if(u32PllSelect == CLK_APLL0_SELECT)
    {
        CLK->SRCCTL &= ~CLK_SRCCTL_APLL0EN_Msk;
    }
    else
    {
        CLK->SRCCTL &= ~CLK_SRCCTL_APLL1EN_Msk;
    }
}

/**
  * @brief      This function check selected clock source status
  * @param[in]  u32ClkMask is selected clock source. Including :
  *             - \ref CLK_STATUS_LIRCSTB_Msk
  *             - \ref CLK_STATUS_LXTSTB_Msk
  *             - \ref CLK_STATUS_MIRCSTB_Msk
  *             - \ref CLK_STATUS_HIRCSTB_Msk
  *             - \ref CLK_STATUS_HXTSTB_Msk
  *             - \ref CLK_STATUS_HIRC48MSTB_Msk
  *             - \ref CLK_STATUS_APLL0STB_Msk
  *             - \ref CLK_STATUS_APLL1STB_Msk  
  * @retval     0  clock is not stable
  * @retval     1  clock is stable
  * @details    To wait for clock ready by specified clock source stable flag or timeout (>500ms)
  */
uint32_t CLK_WaitClockReady(uint32_t u32ClkMask)
{
    uint32_t u32TimeOutCnt = SystemCoreClock>>1; /* 500ms time-out */
    uint32_t u32Ret = 1U;
    printf("wait ready clock select = 0x%08x\n",u32ClkMask);
    while((CLK->STATUS & u32ClkMask) != u32ClkMask)
    {
        if(--u32TimeOutCnt == 0)
        {
            u32Ret = 0U;
            break;
        }
    }

    return u32Ret;
}

/**
  * @brief      This function check selected clock source status
  * @param[in]  u32ClkMask is selected clock source. Including :
  *             - \ref CLK_STATUS_LIRCSTB_Msk
  *             - \ref CLK_STATUS_LXTSTB_Msk
  *             - \ref CLK_STATUS_MIRCSTB_Msk
  *             - \ref CLK_STATUS_HIRCSTB_Msk
  *             - \ref CLK_STATUS_HXTSTB_Msk
  *             - \ref CLK_STATUS_HIRC48MSTB_Msk
  *             - \ref CLK_STATUS_APLL0STB_Msk
  *             - \ref CLK_STATUS_APLL1STB_Msk  
  * @retval     0  clock is timeout
  * @retval     1  clock is disable
  * @details    To wait for clock disable by specified clock source stable flag or timeout (>500ms)
  */
uint32_t CLK_WaitClockDisable(uint32_t u32ClkMask)
{
    uint32_t u32TimeOutCnt = SystemCoreClock>>1;

    uint32_t u32Ret = 1U;
    printf("wait disable clock select = 0x%08x\n",u32ClkMask);
    while (CLK->STATUS & u32ClkMask)
    {
        if (--u32TimeOutCnt == 0)
        {
            u32Ret = 0U;
            break;
        }
    }

    return 1UL;
}

/**
  * @brief      Enable System Tick counter
  * @param[in]  u32ClkSrc is System Tick clock source. Including:
  *             - \ref CLK_STSEL_ST0SEL_HXT
  *             - \ref CLK_STSEL_ST0SEL_LXT
  *             - \ref CLK_STSEL_ST0SEL_HXT_DIV2
  *             - \ref CLK_STSEL_ST0SEL_ACLK_DIV2
  *             - \ref CLK_STSEL_ST0SEL_HIRC_DIV2
  *             - \ref CLK_STSEL_ACLK
  * @param[in]  u32Count is System Tick reload value. It could be 0~0xFFFFFF.
  * @return     None
  * @details    This function set System Tick clock source, reload value, enable System Tick counter and interrupt. \n
  *             The register write-protection function should be disabled before using this function.
  */
void CLK_EnableSysTick(uint32_t u32ClkSrc, uint32_t u32Count)
{
    /* Set System Tick counter disabled */
    SysTick->CTRL = 0UL;

    /* Set System Tick clock source */
    if(u32ClkSrc == CLK_STSEL_ACLK)
    {
        /* Select System Tick clock source from core clock */
        SysTick->CTRL |= SysTick_CTRL_CLKSOURCE_Msk;
        
        /* Disable System Tick clock source from external reference clock */
        CLK->STCTL &= ~CLK_STCTL_ST0CKEN_Msk;        
    }
    else
    {
        /* Select System Tick clock source from external reference clock */
        SysTick->CTRL &= ~SysTick_CTRL_CLKSOURCE_Msk;
        
        /* Enable System Tick clock source from external reference clock */
        CLK->STCTL |= CLK_STCTL_ST0CKEN_Msk;
        
        /* Select System Tick external reference clock source */
        CLK->STSEL = (CLK->STSEL & ~CLK_STSEL_ST0SEL_Msk) | u32ClkSrc;
    }

    /* Set System Tick reload value */
    SysTick->LOAD = u32Count;

    /* Clear System Tick current value and counter flag */
    SysTick->VAL = 0UL;

    /* Set System Tick interrupt enabled and counter enabled */
    SysTick->CTRL |= SysTick_CTRL_TICKINT_Msk | SysTick_CTRL_ENABLE_Msk;
}

/**
  * @brief      Disable System Tick counter
  * @param      None
  * @return     None
  * @details    This function disable System Tick counter.
  */
void CLK_DisableSysTick(void)
{
    /* Set System Tick counter disabled */
    SysTick->CTRL = 0UL;
}

/**
  * @brief      Get PLL0 clock frequency
  * @param      None
  * @return     PLL0 frequency
  * @details    This function get PLL0 frequency. The frequency unit is Hz.
  */
uint32_t CLK_GetAPLL0ClockFreq(void)
{
    uint32_t u32PllFreq = 0UL, u32PllReg;
    uint32_t u32FIN, u32NF, u32NR, u32NO;
    uint8_t au8NoTbl[4] = {1U, 2U, 2U, 4U};

