wosayttn/M55M1BSP/Library/StdDriver/src/clk.c
    u32PllReg = CLK->APLL0CTL;

    if(!(CLK->SRCCTL & CLK_SRCCTL_APLL0EN_Msk))
    {
        u32PllFreq = 0UL;       /* PLL is in power down mode or fix low */
    }
    else                        /* PLL is in normal mode */
    {
        /* PLL0 source clock */
        if((u32PllReg & CLK_APLL0SEL_APLLSRC_Msk) == CLK_APLLCTL_APLLSRC_HIRC)
        {
            u32FIN = __HIRC;        /* PLL0 source clock from HIRC */
        }
        else if((u32PllReg & CLK_APLL0SEL_APLLSRC_Msk) == CLK_APLLCTL_APLLSRC_HXT)
        {
            u32FIN = __HXT;         /* PLL0 source clock from HXT */
        }
        else
        {
             u32FIN = __HIRC48M / 4;     /* PLL0 source clock from HIRC48M/4 */
        }

        /* Calculate PLL0 frequency */
        if(u32PllReg & CLK_APLL0CTL_BP_Msk)
        {
            u32PllFreq = u32FIN;  /* PLL0 is in bypass mode */
        }
        else
        {
            /* PLL0 is output enabled in normal work mode */
            u32NO = au8NoTbl[((u32PllReg & CLK_APLL0CTL_OUTDIV_Msk) >> CLK_APLL0CTL_OUTDIV_Pos)];
            u32NF = ((u32PllReg & CLK_APLL0CTL_FBDIV_Msk) >> CLK_APLL0CTL_FBDIV_Pos) + 2UL;
            u32NR = ((u32PllReg & CLK_APLL0CTL_INDIV_Msk) >> CLK_APLL0CTL_INDIV_Pos) + 1UL;

            /* u32FIN is shifted 2 bits to avoid overflow */
            u32PllFreq = (((u32FIN >> 2) * (u32NF << 1)) / (u32NR * u32NO) << 2);
        }
    }

    return u32PllFreq;
}

/**
  * @brief      Get PLL1 clock frequency
  * @param      None
  * @return     PLL1 frequency
  * @details    This function get PLL1 frequency. The frequency unit is Hz.
  */
uint32_t CLK_GetAPLL1ClockFreq(void)
{
    uint32_t u32PllFreq = 0UL, u32PllReg;
    uint32_t u32FIN, u32NF, u32NR, u32NO;
    uint8_t au8NoTbl[4] = {1U, 2U, 2U, 4U};

    u32PllReg = CLK->APLL1CTL;

    if(!(CLK->SRCCTL & CLK_SRCCTL_APLL1EN_Msk))
    {
        u32PllFreq = 0UL;           /* PLL1 is in power down mode or fix low */
    }
    else /* PLL1 is in normal mode */
    {
        /* PLL source clock */
        if((u32PllReg & CLK_APLL1SEL_APLLSRC_Msk) == CLK_APLLCTL_APLLSRC_HIRC)
        {
            u32FIN = __HIRC;        /* PLL1 source clock from HIRC */
        }
        else if((u32PllReg & CLK_APLL1SEL_APLLSRC_Msk) == CLK_APLLCTL_APLLSRC_HXT)
        {
            u32FIN = __HXT;         /* PLL1 source clock from HXT */
        }
        else
        {
             u32FIN = __HIRC48M / 4;     /* PLL1 source clock from HIRC48M/4 */
        }
        
        /* Calculate PLL1 frequency */
        if(u32PllReg & CLK_APLL1CTL_BP_Msk)
        {
            u32PllFreq = u32FIN;  /* PLL1 is in bypass mode */
        }
        else
        {
            /* PLL1 is output enabled in normal work mode */
            u32NO = au8NoTbl[((u32PllReg & CLK_APLL1CTL_OUTDIV_Msk) >> CLK_APLL1CTL_OUTDIV_Pos)];
            u32NF = ((u32PllReg & CLK_APLL1CTL_FBDIV_Msk) >> CLK_APLL1CTL_FBDIV_Pos) + 2UL;
            u32NR = ((u32PllReg & CLK_APLL1CTL_INDIV_Msk) >> CLK_APLL1CTL_INDIV_Pos) + 1UL;

            /* u32FIN is shifted 2 bits to avoid overflow */
            u32PllFreq = (((u32FIN >> 2) * (u32NF << 1)) / (u32NR * u32NO) << 2);
        }
    }

    return u32PllFreq;
}

/**
  * @brief      Update system clock frequency
  * @param      None
  * @return     System clock frequency
  * @details    This function get system clock frequency. The frequency unit is Hz.
  */
uint32_t SystemClockUpdate(void)
{
    uint32_t SystemClock, u32ClkSrc;
    uint32_t gau32ClkSrcTbl[] = {__HIRC, 0UL, __HIRC48M, __HXT, 0UL,};
    
    /* Update PLL Clock */
    PllClock = CLK_GetAPLL0ClockFreq();

    u32ClkSrc = CLK->SCLKSEL & CLK_SCLKSEL_SCLKSEL_Msk;

    if(u32ClkSrc == CLK_SCLKSEL_SCLKSEL_APLL0)
    {
        /* Use PLL clock */
        SystemClock = PllClock;
    }
    else if(u32ClkSrc == CLK_SCLKSEL_SCLKSEL_MIRC)
    {
        /* Use MIRC clock */
        SystemClock = CLK_GetMIRCFreq();
    }
    else
    {
        /* Use the clock sources directly */
        SystemClock = gau32ClkSrcTbl[u32ClkSrc];        
    }

    return SystemClock;
}

/**
  * @brief      Get selected module clock source
  * @param[in]  u64ModuleIdx is module index.
  *             - \ref BPWM0_MODULE
  *             - \ref BPWM1_MODULE
  *             - \ref CANFD0_MODULE
  *             - \ref CANFD1_MODULE
  *             - \ref CCAP0_MODULE
  *             - \ref DMIC0_MODULE
  *             - \ref EADC0_MODULE
  *             - \ref EADC1_MODULE
  *             - \ref EPWM0_MODULE
  *             - \ref EPWM1_MODULE
  *             - \ref FMC0_MODULE
  *             - \ref I2S0_MODULE
  *             - \ref I2S1_MODULE
  *             - \ref KPI0_MODULE
  *             - \ref LPADC0_MODULE
  *             - \ref LPSPI0_MODULE
  *             - \ref LPTMR0_MODULE
  *             - \ref LPTMR1_MODULE
  *             - \ref LPUART0_MODULE
  *             - \ref PSIO0_MODULE
  *             - \ref QSPI0_MODULE
  *             - \ref QSPI1_MODULE
  *             - \ref SC0_MODULE
  *             - \ref SC1_MODULE
  *             - \ref SC2_MODULE
  *             - \ref SDH0_MODULE
  *             - \ref SDH1_MODULE
  *             - \ref SPI0_MODULE
  *             - \ref SPI1_MODULE
  *             - \ref SPI2_MODULE
  *             - \ref SPI3_MODULE
  *             - \ref ST0_MODULE
  *             - \ref TMR0_MODULE
  *             - \ref TMR1_MODULE
  *             - \ref TMR2_MODULE
  *             - \ref TMR3_MODULE
  *             - \ref TTMR0_MODULE
  *             - \ref TTMR1_MODULE
  *             - \ref UART0_MODULE
  *             - \ref UART1_MODULE
  *             - \ref UART2_MODULE
  *             - \ref UART3_MODULE
  *             - \ref UART4_MODULE
  *             - \ref UART5_MODULE
  *             - \ref UART6_MODULE
  *             - \ref UART7_MODULE
  *             - \ref UART8_MODULE
  *             - \ref UART9_MODULE
  *             - \ref USBD0_MODULE
  *             - \ref USBH0_MODULE
  *             - \ref WDT0_MODULE
  *             - \ref WWDT0_MODULE
  *             - \ref WWDT1_MODULE
  * @return     Selected module clock source setting
  * @details    This function get selected module clock source.
  */
uint32_t CLK_GetModuleClockSource(uint64_t u64ModuleIdx)
{
    uint32_t u32TmpVal = 0UL, u32TmpAddr = 0UL;
    uint32_t u32RTCCKEN = CLK->RTCCTL & CLK_RTCCTL_RTC0CKEN_Msk;

    /* Get clock source selection setting */
    if(u64ModuleIdx == RTC0_MODULE)
    {
        if(u32RTCCKEN == 0UL)
        {
            /* Enable RTC clock to get LXT clock source */
            CLK->RTCCTL |= CLK_RTCCTL_RTC0CKEN_Msk;
        }

        u32TmpVal = ((RTC->LXTCTL & RTC_LXTCTL_RTCCKSEL_Msk) >> RTC_LXTCTL_RTCCKSEL_Pos);

        if(u32RTCCKEN == 0UL)
        {
            /* Disable RTC clock if it is disabled before */
            CLK->RTCCTL &= (~CLK_RTCCTL_RTC0CKEN_Msk);
        }
    }
    else if((uint32_t)MODULE_CLKSEL_Msk(u64ModuleIdx) != MODULE_NoMsk)
    {
        /* Get clock select control register address */
        u32TmpAddr = (uint32_t)MODULE_CLKSEL_BASE + (uint32_t)(MODULE_CLKSEL(u64ModuleIdx) << 2);

        /* Get clock source selection setting */
        u32TmpVal = (inpw((uint32_t *)u32TmpAddr) & (uint32_t)(MODULE_CLKSEL_Msk(u64ModuleIdx) << (uint32_t)MODULE_CLKSEL_Pos(u64ModuleIdx))) >> (uint32_t)MODULE_CLKSEL_Pos(u64ModuleIdx);
    }

    return u32TmpVal;
}

/**
  * @brief      Get selected module clock divider number
  * @param[in]  u64ModuleIdx is module index.
  *             - \ref CANFD0_MODULE
  *             - \ref CANFD1_MODULE
  *             - \ref DMIC0_MODULE
  *             - \ref EADC0_MODULE
  *             - \ref EADC1_MODULE
  *             - \ref I2S0_MODULE
  *             - \ref I2S1_MODULE
  *             - \ref KPI0_MODULE
  *             - \ref LPADC0_MODULE
  *             - \ref LPUART0_MODULE
  *             - \ref PSIO0_MODULE
  *             - \ref SC0_MODULE
  *             - \ref SC1_MODULE
  *             - \ref SC2_MODULE
  *             - \ref SDH0_MODULE
  *             - \ref SDH1_MODULE
  *             - \ref ST0_MODULE
  *             - \ref UART0_MODULE
  *             - \ref UART1_MODULE
  *             - \ref UART2_MODULE
  *             - \ref UART3_MODULE
  *             - \ref UART4_MODULE
  *             - \ref UART5_MODULE
  *             - \ref UART6_MODULE
  *             - \ref UART7_MODULE
  *             - \ref UART8_MODULE
  *             - \ref UART9_MODULE
  *             - \ref USBD0_MODULE
  *             - \ref USBH0_MODULE
  * @return     Selected module clock divider number setting
  * @details    This function get selected module clock divider number.
  */
uint32_t CLK_GetModuleClockDivider(uint64_t u64ModuleIdx)
{
    uint32_t u32DivVal = 0UL, u32DivAddr = 0UL;

    /* Get clock divider control register address */
    u32DivAddr = (uint32_t)MODULE_CLKDIV_BASE + ((uint32_t)MODULE_CLKDIV(u64ModuleIdx) << 2);
    
    /* Get clock divider number setting */
    u32DivVal = (inpw((uint32_t *)u32DivAddr) & (uint32_t)(MODULE_CLKDIV_Msk(u64ModuleIdx) << (uint32_t)MODULE_CLKDIV_Pos(u64ModuleIdx))) >> (uint32_t)MODULE_CLKDIV_Pos(u64ModuleIdx);

    return u32DivVal;
}

/** @} end of group CLK_EXPORTED_FUNCTIONS */
/** @} end of group CLK_Driver */
/** @} end of group Standard_Driver */
